routes_practice/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 7]]
---
  def create
    @artwork_share = ArtworkShare.new(share_params)

    if @artwork_share.save