routes_practice/app/controllers/comments_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def index
        @artwork = Artwork.find_by(id: params[:artwork_id])
        @user = User.find_by(id: params[:user_id])

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 7], ["artwork_id", 1], ["body", "this art is whack."], ["created_at", "2022-03-31 21:23:22.994263"], ["updated_at", "2022-03-31 21:23:22.994263"]]
---
    def create
        @comment = Comment.new(comment_params)

        if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
    def destroy
        @comment = Comment.find(params[:id])
        @shadow_comment = @comment.dup
        render json: @shadow_comment
        @comment.destroy