routes_practice/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username like '%'da'%')
SELECT "users".* FROM "users"
---
    def index
        # @users
        if params[:user] && params[:user].has_key?(:query)
            query = "%#{params[:user][:query]}%"
            @users = User.where("username like ?",query)
        else
            @users = User.all

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Jeremey"], ["email", "new@mail.com"]]
---
    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys

        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Jeremy"], ["email", "Jeremy@mail.com"], ["id", 4]]
---
    def update
        @user = User.find_by(id: params[:id])

        if @user.update(user_params)